// pages/clothes/clothes.js
Page({

  /**
   * 页面的初始数据
   */
 data: {
	textList:[
		{
			id: 1,
			text:'  《春秋左传正义》有曰：中国有礼仪之大，故称夏；有服章之美，谓之华。'
		},
		{
			id: 2,
			text:'  在现代服装中很多的元素都来自传统中式服装。传统中式服装的款式多为H型，斜门襟，开衩等形式。领子多为立领或者斜交领。'
		},
		{
			id: 3,
			text:'  中国文化历史久远，源远流长，而中华民族的服饰文化和五千年的文明一样具有独特而悠久的艺术审美历程，成为文化宝库里至为珍贵的瑰宝。'
		},
		{
			id: 4,
			text:'  文化的迷人之处，在于其经久不衰。中式服装沉淀着历史，体现了人们的生活习俗、审美情趣、社会风貌，做到对传统文化的致敬和承袭。'
		}
	]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  

  

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})